# Problem statement
- Import Data from different Sources such as (Excel, Sql Server, Oracle etc.) and load in
targeted system.

In [1]:
import pandas as pd

## Loading from Excel

In [5]:
excel_data = pd.read_excel('large_dataset.xlsx')
excel_data.head()

   EmployeeID   Name Department  Salary
0       10001  David         IT   96738
1       10002  David         IT   62607
2       10003  David         HR   91800
3       10004  Frank      Sales  101751
4       10005  David         HR   60648

## Loading from mysql server

In [7]:
from sqlalchemy import create_engine
import pymysql

engine = create_engine(
    'mysql+pymysql://root:SQLpassword@localhost/sqlpractical'
)
mysql_data = pd.read_sql_table('Sales',engine)
mysql_data.head()

  order_date product_category  sales
0 2024-01-01             Toys    743
1 2024-01-02         Clothing    333
2 2024-01-03       Appliances    607
3 2024-01-04             Toys    139
4 2024-01-05             Toys    465

## Loading from CSV File

In [ ]:
csv_data = pd.read_csv('large_dataset.csv')

## Concatination of Data

In [ ]:
df = pd.concat([excel_data, mysql_data, csv_data], axis=0)

## Loading to targeted system (MySql)

In [ ]:
df.to_sql('Temp',engine,if_exists = 'replace', index=False)